#pragma once

#define BOTTOM_LEVEL 1
#define INTERFACE_LEVEL 3
#define WHITEBOARD_LEVEL 2
// for hand drawing
#define HAND_MODE    1
#define PEN_MODE     2
#define ERASER_MODE  3

//每單元題目數量
const int QUEDATA[5] = { 3,2,2,3,2 };

// 單元題目可使用的分母  [][0] = 分母數量  [][1~11] = 分母
const int UNIT_1[6][12] = {
	{ 5, 2, 4, 6, 8, 12, 0, 0, 0, 0, 0, 0},
	{ 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 3, 2, 4, 8, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 4, 2, 4, 5, 6, 0, 0, 0, 0, 0, 0, 0 },
	{ 5, 2, 4, 5, 6, 8, 0, 0, 0, 0, 0, 0 },
	{ 7, 2, 4, 5, 6, 8, 10, 12, 0, 0, 0, 0 } };

const int UNIT_2[2][12] = {
	{ 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 4, 2, 4, 5, 6, 0, 0, 0, 0, 0, 0, 0 } };

const int UNIT_3[2][12] = {
	{ 7, 2, 4, 5, 6, 8, 10, 12, 0, 0, 0, 0 },
	{ 4, 2, 4, 5, 6, 0, 0, 0, 0, 0, 0, 0 } };

const int UNIT_4[3][12] = {
	{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
	{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 },
	{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 } };

const int UNIT_5[2][12] = {
	{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
	{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 } };