#pragma once

#define EQULBOARD_LEVEL 5
#define EQULBTN_LEVEL   6
#define DRAWING_LEVEL	8
//#define QUE_LEVEL		10
#define INTERFACE_LEVEL 12

// for hand drawing
#define DRAWING_MODE     1
#define ERASER_MODE      2
#define MOVEINGOBJ_MODE  3
#define REMOVEALL_MODE   4

//每單元題目數量
//const int QUEDATA[5] = { 6,12,5,6,5 };
const int QUEDATA[5] = { 6,1,2,3,2 };

// for unit   [0] = 平分按鈕數量 [1~最後] = 可平分的量
//const int UNIT_1[6][12] = { 
//{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
//{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 },
//{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
//{ 4, 4, 5, 6, 10, 0, 0, 0, 0, 0, 0, 0 },
//{ 4, 4, 5, 6, 10, 0, 0, 0, 0, 0, 0, 0 },
//{ 5, 4, 5, 6, 10, 0, 0, 0, 0, 0, 0, 0 } };

const int UNIT_1[6][12] = {
	{ 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 3, 2, 4, 5, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 4, 2, 4, 5, 6, 0, 0, 0, 0, 0, 0, 0 },
	{ 5, 2, 4, 5, 6, 8, 0, 0, 0, 0, 0, 0 },
	{ 7, 2, 4, 5, 6, 8, 10, 12, 0, 0, 0, 0 } };

// for unit2   [0] = 平分按鈕數量 [1~最後] = 可平分的量
const int UNIT_2[1][12] = { 
{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 }};

// for unit3   [0] = 平分按鈕數量 [1~最後] = 可平分的量
const int UNIT_3[2][12] = { 
{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 }};

// for unit4   [0] = 平分按鈕數量 [1~最後] = 可平分的量
const int UNIT_4[3][12] = { 
{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 },
{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 }};

// for unit5   [0] = 平分按鈕數量 [1~最後] = 可平分的量
const int UNIT_5[2][12] = { 
{ 7, 2, 3, 4, 5, 6, 8, 10, 0, 0, 0, 0 },
{ 5, 2, 3, 4, 5, 6, 0, 0, 0, 0, 0, 0 } };


